[
    {
        "Rating": "R",
        "MovieId": 1,
        "Title": "The Breakfast Club",
        "PlotSummary": "Five high school students meet in Saturday detention and discover how they have a lot more in common than they thought.",
        "ReleaseYear": 1985
    },
    {
        "Rating": "PG",
        "MovieId": 2,
        "Title": "Real Genius",
        "PlotSummary": "Teenage geniuses deal with their abilities while developing a high-powered laser for a university project. When their professor intends to turn their work into a military weapon, they decide to ruin his plans.",
        "ReleaseYear": 1985
    },
    {
        "Rating": "PG",
        "MovieId": 3,
        "Title": "Sixteen Candles",
        "PlotSummary": "A girl's \"sweet\" sixteenth birthday becomes anything but special, as she suffers from every embarrassment possible.",
        "ReleaseYear": 1984
    },
    {
        "Rating": "PG-13",
        "MovieId": 4,
        "Title": "Weird Science",
        "PlotSummary": "Two high school nerds attempt to create the perfect woman, but she turns out to be more than that.",
        "ReleaseYear": 1985
    },
    {
        "Rating": "PG-13",
        "MovieId": 5,
        "Title": "Pretty in Pink",
        "PlotSummary": "A poor girl must choose between the affections of dating her childhood sweetheart or a rich but sensitive playboy.",
        "ReleaseYear": 1986
    },
    {
        "Rating": "PG",
        "MovieId": 6,
        "Title": "Back to the Future",
        "PlotSummary": "Marty McFly, a 17-year-old high school student, is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his close friend, the maverick scientist Doc Brown.",
        "ReleaseYear": 1985
    },
    {
        "Rating": "PG",
        "MovieId": 7,
        "Title": "Back to the Future Part II",
        "PlotSummary": "After visiting 2015, Marty McFly must repeat his visit to 1955 to prevent disastrous changes to 1985...without interfering with his first trip.",
        "ReleaseYear": 1989
    },
    {
        "Rating": "PG",
        "MovieId": 8,
        "Title": "Star Wars: Episode V - The Empire Strikes Back",
        "PlotSummary": "After the rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training with Yoda, while his friends are pursued by Darth Vader.",
        "ReleaseYear": 1980
    },
    {
        "Rating": "PG",
        "MovieId": 9,
        "Title": "Star Wars: Episode VI - Return of the Jedi",
        "PlotSummary": "After a daring mission to rescue Han Solo from Jabba the Hutt, the rebels dispatch to Endor to destroy a more powerful Death Star. Meanwhile, Luke struggles to help Vader back from the dark side without falling into the Emperor's trap.",
        "ReleaseYear": 1983
    },
    {
        "Rating": "PG",
        "MovieId": 10,
        "Title": "Star Trek II: The Wrath of Khan",
        "PlotSummary": "With the assistance of the Enterprise crew, Admiral Kirk must stop an old nemesis, Khan Noonien Singh, from using the life-generating Genesis Device as the ultimate weapon.",
        "ReleaseYear": 1982
    },
    {
        "Rating": "PG",
        "MovieId": 11,
        "Title": "Star Trek IV: The Voyage Home",
        "PlotSummary": "To save Earth from an alien probe, Admiral James T. Kirk and his fugitive crew go back in time to San Francisco in 1986 to retrieve the only beings who can communicate with it: humpback whales.",
        "ReleaseYear": 1986
    },
    {
        "Rating": "PG",
        "MovieId": 12,
        "Title": "E.T. the Extra-Terrestrial",
        "PlotSummary": "A troubled child summons the courage to help a friendly alien escape Earth and return to his home world.",
        "ReleaseYear": 1982
    },
    {
        "Rating": "PG-13",
        "MovieId": 13,
        "Title": "Dirty Dancing",
        "PlotSummary": "Spending the summer at a Catskills resort with her family, Frances \"Baby\" Houseman falls in love with the camp's dance instructor, Johnny Castle.",
        "ReleaseYear": 1987
    },
    {
        "Rating": "R",
        "MovieId": 14,
        "Title": "Platoon",
        "PlotSummary": "A young soldier in Vietnam faces a moral crisis when confronted with the horrors of war and the duality of man.",
        "ReleaseYear": 1986
    },
    {
        "Rating": "PG",
        "MovieId": 15,
        "Title": "The Princess Bride",
        "PlotSummary": "While home sick in bed, a young boy's grandfather reads him a story called The Princess Bride.",
        "ReleaseYear": 1987
    },
    {
        "Rating": "PG",
        "MovieId": 16,
        "Title": "Raiders of the Lost Ark",
        "PlotSummary": "In 1936, archaeologist and adventurer Indiana Jones is hired by the U.S. government to find the Ark of the Covenant before Adolf Hitler's Nazis can obtain its awesome powers.",
        "ReleaseYear": 1981
    },
    {
        "Rating": "PG",
        "MovieId": 17,
        "Title": "Indiana Jones and the Temple of Doom",
        "PlotSummary": "In 1935, Indiana Jones arrives in India, still part of the British Empire, and is asked to find a mystical stone. He then stumbles upon a secret cult committing enslavement and human sacrifices in the catacombs of an ancient palace.",
        "ReleaseYear": 1984
    },
    {
        "Rating": "PG-13",
        "MovieId": 18,
        "Title": "Indiana Jones and the Last Crusade",
        "PlotSummary": "In 1938, after his father Professor Henry Jones, Sr. goes missing while pursuing the Holy Grail, Indiana Jones finds himself up against Adolf Hitler's Nazis again to stop them obtaining its powers.",
        "ReleaseYear": 1989
    },
    {
        "Rating": "R",
        "MovieId": 19,
        "Title": "The Terminator",
        "PlotSummary": "A seemingly indestructible android is sent from 2029 to 1984 to assassinate a waitress, whose unborn son will lead humanity in a war against the machines, while a soldier from that war is sent to protect her at all costs.",
        "ReleaseYear": 1984
    },
    {
        "Rating": "PG",
        "MovieId": 20,
        "Title": "Who Framed Roger Rabbit",
        "PlotSummary": "A toon-hating detective is a cartoon rabbit's only hope to prove his innocence when he is accused of murder.",
        "ReleaseYear": 1988
    },
    {
        "Rating": "R",
        "MovieId": 21,
        "Title": "When Harry Met Sally...",
        "PlotSummary": "Harry and Sally have known each other for years, and are very good friends, but they fear sex would ruin the friendship.",
        "ReleaseYear": 1989
    },
    {
        "Rating": "PG",
        "MovieId": 22,
        "Title": "Labyrinth",
        "PlotSummary": "A 16-year-old girl is given 13 hours to solve a labyrinth and rescue her baby brother when her wish for him to be taken away is granted by the Goblin King.",
        "ReleaseYear": 1986
    },
    {
        "Rating": "PG",
        "MovieId": 23,
        "Title": "Legend",
        "PlotSummary": "A young man must stop the Lord of Darkness from both destroying daylight and marrying the woman he loves.",
        "ReleaseYear": 1985
    },
    {
        "Rating": "PG",
        "MovieId": 24,
        "Title": "Bill & Ted's Excellent Adventure",
        "PlotSummary": "Two seemingly dumb teens set off on a quest to prepare the ultimate historical presentation with the help of a time machine.",
        "ReleaseYear": 1989
    },
    {
        "Rating": "PG",
        "MovieId": 25,
        "Title": "Top Gun",
        "PlotSummary": "As students at the United States Navy's elite fighter weapons school compete to be best in the class, one daring young pilot learns a few things from a civilian instructor that are not taught in the classroom.",
        "ReleaseYear": 1986
    },
    {
        "Rating": "PG-13",
        "MovieId": 26,
        "Title": "Little Shop of Horrors",
        "PlotSummary": "A nerdy florist finds his chance for success and romance with the help of a giant man-eating plant who demands to be fed.",
        "ReleaseYear": 1986
    }
]